import { Button } from "@heroui/button";
import React, { useEffect, useRef, useState } from "react";

function AboutSection() {
  const [seeMore, setSeeMore] = useState<boolean>(false);

  const AboutSectionRef = useRef<HTMLDivElement | null>(null);

  const seeMoreToggleHandler = () => {
    setSeeMore(!seeMore);

    if (seeMore === true && AboutSectionRef.current) {
      window.scrollTo(0, AboutSectionRef.current?.offsetTop);
    }
  };
  

  return (
    <section className="container flex flex-col items-center mt-[100px] lg:mt-40" ref={AboutSectionRef}>
      <div className={`h-64 overflow-hidden relative ${seeMore ? "h-fit" : "h-64"}`}>
        <div className="">
          <h2 className="font-DanaDemiBold text-2xl mb-3 mt-8">با دوره‌های سبزلرن برنامه‌نویس حرفه‌ای شوید!</h2>

          <p className="text-medium font-DanaRegular text-gray-700 dark:text-gray-400 leading-7">اگر در ابتدای مسیر یادگیری برنامه‌نویسی قرار دارید یا بعد از چند سال فعالیت حرفه‌ای به‌عنوان برنامه‌نویس به‌دنبال فتح قله‌های جدید در این حوزه هستید، دوره‌های سبزلرن شما را به هدفتان می‌رسانند. در این آکادمی همه چیز برای یادگیری برنامه‌نویسی از صفر یا دریافت آموزش‌های تکمیلی برای تبدیل شدن به یک برنامه‌نویس کاربلد مهیا است. در سبزلرن دوره‌های آموزشی متنوع با کمترین هزینه و پشتیبانی مستمر آماده شده تا بدون نیاز به کتاب یا دوره دیگر، بتوانید صفر تا صد برنامه‌نویسی را یاد بگیرید. تجربه‌های دانشجویان قبلی نشان می‌دهد که سبک تدریس اساتید مجرب سبزلرن نه تنها آموزش‌های استاندارد را با پروژه‌های واقعی ترکیب می‌کند، بلکه به دانشجویان انگیزه و اعتمادبه‌نفس لازم برای ادامه مسیر برنامه‌نویسی را می‌دهد. سبزلرن با تمرکز بر آموزش‌های منطبق با نیازهای بازار کار ایران و استفاده از روش‌های تدریس بومی‌سازی‌شده، تضمین می‌کند که نه تنها مطالب به‌روز و حرفه‌ای را یاد بگیرید، بلکه با آمادگی کامل وارد بازار کار شوید.</p>

          <h2 className="font-DanaDemiBold text-xl mb-3 mt-8">آموزش برنامه نویسی به سبکی منحصربه فرد</h2>

          <p className="text-medium font-DanaRegular text-gray-700 dark:text-gray-400 leading-7 ">شمایی که وارد این صفحه شدید، احتمالا قبلا با چند مرکز آموزش دوره برنامه نویسی آشنا شده و احتمالا بعد از این هم به تحقیقتون ادامه میدید. اما حالا که مهمان سبزلرن شدید، بد نیست در جریان چکیده ای از تجربیات و ذهنیت سبزلرن در آموزش کدنویسی رو هم قرار بگیرید تا به تصمیم گیری نهایی شما کمک کنه. حس سردرگمی و تردید در انتخاب منبع آموزشی و گاهی مسیر یادگیری برنامه نویسی تقریبا بین همه علاقمندان این تخصص جذاب مشترک بوده چون تا دلتون بخواد شعار آموزش برنامه نویسی از صفر و آموزش برنامه نویسی رایگان و ... سراسر وب رو پر کرده اما وقتی شروع به آموزش دیدن می کنید، می بینید که یا مدرس مسلط نیست، یا مسیر آموزشی شفاف و استاندارد نیست و یا سبک و لحن تدریس و ارائه تمرینات طوری نیست که بتونید به راحتی باهاش ارتباط بگیرید و در کوتاه مدت به عمل برسونید. شاید براتون جالب باشه که بعضی از دانشجوهای سبزلرن گفتن که قبل از گذروندن دوره های آموزش برنامه نویسی سبزلرن، به واسطه دوره های غیر استاندارد گذشته تصمیم گرفته بودن کلا از دنیای برنامه نویسی خداحافظی کنن و احساس میکردن استعداد این رشته رو ندارن اما وقتی با سبک و استراتژی آموزشی سبزلرن در آموزش برنامه نویسی از صفر&nbsp; آشنا شدن، اتفاقا علاقه و انگیزه شون برای ادامه این مسیر دوست داشتنی و پولساز بیشتر هم شد و اعتماد به نفس فوق‌العاده ای پیدا کردن. بنابراین چه اول راه یادگیری برنامه نویسی باشید و چه در حال توسعه مهارت های خودتون، منبع آموزشی به روز و حرفه ای مثل سبزلرن به تنهایی میتونه تمام انتظارات و نیازهای شمارو پوشش بده. خب هر ادعایی سند و مدرک هم میخواد پس بیاید یه دور دلایل این ادعا رو باهم بررسی کنیم</p>

          <h3 className="text-lg font-DanaDemiBold mb-3 mt-8">1. آموزش برنامه نویسی رایگان</h3>

          <p className="text-medium font-DanaRegular text-gray-700 dark:text-gray-400 leading-7 ">سبزلرن اعتقاد داره ورود هر علاقه مندی به دنیای آموزش کدنویسی باید بدون ریسک باشه و هیچ دغدغه ای جز تمرکز روی یادگیری در ذهن اون فرد نباشه. به همین دلیل می بینید که در طرح آموزش برنامه نویسی رایگان سبزلرن، تمام زبان ها و تکنولوژی های اصلی مثل جاوا اسکریپت، پایتون، CSS ، HTML و چندین دوره دیگه به صورت رایگان و همراه با پشتیبانی مادام العمر آموزش داده میشه که همه اونها در دسته آموزش صفر تا صد برنامه نویسی هم هستن و برخلاف دیگران، به بهانه رایگان بودن چیزی از کیفیت و حجم محتوای دوره ها کم نشده!</p>

          <h3 className="text-lg font-DanaDemiBold mb-3 mt-8">2.آموزش کدنویسی بدون ریسک</h3>

          <p className="text-medium font-DanaRegular text-gray-700 dark:text-gray-400 leading-7 ">با توجه به مورد قبلی، کاملا واضحه که نگرش سبزلرن، دریافت هزینه آموزش برنامه نویسی از کسانی هست که مسیر قطعی خودشون رو پیدا کردن و قصد توسعه مهارت ها و تکنیک های خودشون رو دارن نه همه! دومین نکته اینه که شما با گذروندن یا دیدن چند جلسه از دوره های رایگان با سبک و کیفیت محتوای دوره برنامه نویسی سبزلرن آشنا میشید و به این ترتیب ریسک شما برای پرداخت هزینه آموزش های بعدی صفر خواهد بود.</p>

          <h3 className="text-lg font-DanaDemiBold mb-3 mt-8">3.آموزش صفر تا صد برنامه نویسی واقعی!</h3>

          <p className="text-medium font-DanaRegular text-gray-700 dark:text-gray-400 leading-7 ">همونطور که میدونید سرفصل های هر تخصص برنامه نویسی به صورت بین المللی تدوین شده اما گاهی برای ایرانی ها به دلیل محدودیت ها و مسائل تکنیکی کدنویسی، این سرفصل ها باید بومی سازی شده و با مثال ها و پروژه های ایرانی تدریس بشن تا دانشجو در فضای بازار کار قرار بگیره. فرآیند بومی سازی هم نیاز به مطالعه و تسلط خیلی زیادی داره که در عین حفظ ساختار کامل دوره برنامه نویسی، اون رو به محتوایی منطبق بر نیاز دانشجوهای ایرانی، روان‌تر و عملی‌تر تبدیل کنه. بنابراین در سبزلرن قرار نیست کتابی و خشک این مهارت جذاب رو یاد بگیرید.</p>

          <h3 className="text-lg font-DanaDemiBold mb-3 mt-8">4.دوره برنامه نویسی با تضمین نقد</h3>

          <p className="text-medium font-DanaRegular text-gray-700 dark:text-gray-400 leading-7 ">ضمانت ها معمولا بعد از فروش ارائه میشن اما سبزلرن به عنوان ضمانت پیش‌دستانه، 20 الی 40 درصد همه دوره های پولی رو هم به رایگان در اختیار علاقه‌مندان گذاشته تا دیگه هیچ حرف و حدیث و اصطلاحا هندونه دربسته‌ای در کار نباشه و خیلی راحت تصمیمشون برای انتخاب بهترین منبع آموزش برنامه نویسی رو بگیرن.</p>

          <h3 className="text-lg font-DanaDemiBold mb-3 mt-8">5.آموزش برنامه نویسی از صفر با همراهی پشتیبان مسلط</h3>

          <p className="text-medium font-DanaRegular text-gray-700 dark:text-gray-400 leading-7 ">نکته مهم بعدی اینه که سبزلرن اعتقاد داره ارائه آموزش برنامه نویسی به تنهایی، لزوما به معنی تربیت یک برنامه نویس حرفه ای نیست و حتما نیاز داره که پشتیبانان فنی مسلط و آشنا به شرایط بازار کار هر رشته قدم به قدم در کنار دانشجو باشن تا از لحظه شروع دوره برنامه نویسی تا تدوین رزومه، جلسه مصاحبه استخدام و چالش های بعد از استخدام همراهی لازم و دلسوزانه رو داشته باشن.</p>

          <h3 className="text-lg font-DanaDemiBold mb-3 mt-8">6.یادگیری برنامه نویسی با چشم باز</h3>

          <p className="text-medium font-DanaRegular text-gray-700 dark:text-gray-400 leading-7 ">آخرین نکته هم توصیه ما به مطالعه کامنت دانشجوهای قبلی سبزلرن هست که در صفحه هر دوره آموزش برنامه نویسی میتونید مطالعه کنید و بر اساس برآیند کلی نظرات، درصد رضایت رو محاسبه کنید.</p>
        </div>
        {!seeMore ? <div className="w-full h-64 absolute right-0 bottom-0 bg-gradient-to-b from-transparent from-5% to-gray-100 dark:to-gray-900"></div> : null}
      </div>
      <Button className={`btn-primary--outline text-primary rounded-lg h-10 px-3 text-sm font-DanaRegular mt-4 ${seeMore ? "bg-[#1eb35b1a]" : "bg-transparent"}`} onPress ={seeMoreToggleHandler}>
        {seeMore ? "مشاهده کمتر" : "مشاهده بیشتر"}
      </Button>
    </section>
  );
}

export default AboutSection;
